# Итоговая проверочная работа
---
## Задача

Написать программу, которая из ***имеющегося массива строк*** формирует ***новый массив из строк***, длина которых меньше, либо равна **3** символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.

При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно *массивами*.

### Решение:

1. Задаём массив **arrayA** на старте выполнения алгоритма.
2. Отводим определенное количество памяти для нового массива **arrayB**, который будет являться результатом решения задачи. Его длина будет равна длине массива **arrayA**.
3. Создаём метод **ArrayNew** для нахождения элементов массива **arrayB**: выполняем цикл *for (int i = 0; i < size; i++)*. Цикл выполняется столько раз, сколько элементов в массиве, при этом при каждой интерации проверяется условие: *if (arrayA[i].Length <= 3)*, в котором проверяется сколько символов в текущем элементе массива. Если количество символов меньше или равно **3**, то значение записывается в элемент массива. (При этом *count* - счетчик для определения длины  массива **arrayB**).
4. Используем метод **ArrayNew**
5. Делаем отступ строки *Console.WriteLine()*.
6. Методом **PrintArray** выводим массив **arrayB** на экран.